RT-Thread/rt-thread/bsp/microchip/saml10/bsp/include/saml10d16a.h
/** \addtogroup SAML10D16A_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAML10D16A */
/* ************************************************************************** */
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC                     (0x40003400)                   /**< \brief (AC        ) Base Address */
#define ADC                    (0x42001C00)                   /**< \brief (ADC       ) Base Address */
#define CCL                    (0x42002C00)                   /**< \brief (CCL       ) Base Address */
#define DAC                    (0x42002000)                   /**< \brief (DAC       ) Base Address */
#define DMAC                   (0x41006000)                   /**< \brief (DMAC      ) Base Address */
#define DSU                    (0x41002000)                   /**< \brief (DSU       ) Base Address */
#define DSU_EXT                (0x41002100)                   /**< \brief (DSU       ) Base Address */
#define EIC                    (0x40002800)                   /**< \brief (EIC       ) Base Address */
#define EVSYS                  (0x42000000)                   /**< \brief (EVSYS     ) Base Address */
#define FREQM                  (0x40002C00)                   /**< \brief (FREQM     ) Base Address */
#define GCLK                   (0x40001C00)                   /**< \brief (GCLK      ) Base Address */
#define IDAU                   (0x41000000)                   /**< \brief (IDAU      ) Base Address */
#define MCLK                   (0x40000800)                   /**< \brief (MCLK      ) Base Address */
#define NVMCTRL                (0x41004000)                   /**< \brief (NVMCTRL   ) Base Address */
#define OPAMP                  (0x42003000)                   /**< \brief (OPAMP     ) Base Address */
#define OSCCTRL                (0x40001000)                   /**< \brief (OSCCTRL   ) Base Address */
#define OSC32KCTRL             (0x40001400)                   /**< \brief (OSC32KCTRL) Base Address */
#define PAC                    (0x40000000)                   /**< \brief (PAC       ) Base Address */
#define PM                     (0x40000400)                   /**< \brief (PM        ) Base Address */
#define PORT                   (0x40003000)                   /**< \brief (PORT      ) Base Address */
#define PORT_IOBUS             (0x60000000)                   /**< \brief (PORT      ) Base Address */
#define PTC                    (0x42002400)                   /**< \brief (PTC       ) Base Address */
#define RSTC                   (0x40000C00)                   /**< \brief (RSTC      ) Base Address */
#define RTC                    (0x40002400)                   /**< \brief (RTC       ) Base Address */
#define SERCOM0                (0x42000400)                   /**< \brief (SERCOM0   ) Base Address */
#define SERCOM1                (0x42000800)                   /**< \brief (SERCOM1   ) Base Address */
#define SUPC                   (0x40001800)                   /**< \brief (SUPC      ) Base Address */
#define TC0                    (0x42001000)                   /**< \brief (TC0       ) Base Address */
#define TC1                    (0x42001400)                   /**< \brief (TC1       ) Base Address */
#define TC2                    (0x42001800)                   /**< \brief (TC2       ) Base Address */
#define TRAM                   (0x42003400)                   /**< \brief (TRAM      ) Base Address */
#define TRNG                   (0x42002800)                   /**< \brief (TRNG      ) Base Address */
#define WDT                    (0x40002000)                   /**< \brief (WDT       ) Base Address */

#else /* For C/C++ compiler */

#define AC                     ((Ac *)0x40003400U)            /**< \brief (AC        ) Base Address */
#define AC_INST_NUM            1                              /**< \brief (AC        ) Number of instances */
#define AC_INSTS               { AC }                         /**< \brief (AC        ) Instances List */

#define ADC                    ((Adc *)0x42001C00U)           /**< \brief (ADC       ) Base Address */
#define ADC_INST_NUM           1                              /**< \brief (ADC       ) Number of instances */
#define ADC_INSTS              { ADC }                        /**< \brief (ADC       ) Instances List */

#define CCL                    ((Ccl *)0x42002C00U)           /**< \brief (CCL       ) Base Address */
#define CCL_INST_NUM           1                              /**< \brief (CCL       ) Number of instances */
#define CCL_INSTS              { CCL }                        /**< \brief (CCL       ) Instances List */

#define DAC                    ((Dac *)0x42002000U)           /**< \brief (DAC       ) Base Address */
#define DAC_INST_NUM           1                              /**< \brief (DAC       ) Number of instances */
#define DAC_INSTS              { DAC }                        /**< \brief (DAC       ) Instances List */

#define DMAC                   ((Dmac *)0x41006000U)          /**< \brief (DMAC      ) Base Address */
#define DMAC_INST_NUM          1                              /**< \brief (DMAC      ) Number of instances */
#define DMAC_INSTS             { DMAC }                       /**< \brief (DMAC      ) Instances List */

#define DSU                    ((Dsu *)0x41002000U)           /**< \brief (DSU       ) Base Address */
#define DSU_EXT                ((Dsu *)0x41002100U)           /**< \brief (DSU       ) Base Address */
#define DSU_INST_NUM           1                              /**< \brief (DSU       ) Number of instances */
#define DSU_INSTS              { DSU }                        /**< \brief (DSU       ) Instances List */

#define EIC                    ((Eic *)0x40002800U)           /**< \brief (EIC       ) Base Address */
#define EIC_INST_NUM           1                              /**< \brief (EIC       ) Number of instances */
#define EIC_INSTS              { EIC }                        /**< \brief (EIC       ) Instances List */

#define EVSYS                  ((Evsys *)0x42000000U)         /**< \brief (EVSYS     ) Base Address */
#define EVSYS_INST_NUM         1                              /**< \brief (EVSYS     ) Number of instances */
#define EVSYS_INSTS            { EVSYS }                      /**< \brief (EVSYS     ) Instances List */

#define FREQM                  ((Freqm *)0x40002C00U)         /**< \brief (FREQM     ) Base Address */
#define FREQM_INST_NUM         1                              /**< \brief (FREQM     ) Number of instances */
#define FREQM_INSTS            { FREQM }                      /**< \brief (FREQM     ) Instances List */

#define GCLK                   ((Gclk *)0x40001C00U)          /**< \brief (GCLK      ) Base Address */
#define GCLK_INST_NUM          1                              /**< \brief (GCLK      ) Number of instances */
#define GCLK_INSTS             { GCLK }                       /**< \brief (GCLK      ) Instances List */

